---
kind: type
id: T:Autodesk.Revit.DB.Architecture.RailTypeDefaultJoinOption
source: html/580cccc7-8138-2dbd-38fe-c6b82a514997.htm
---
# Autodesk.Revit.DB.Architecture.RailTypeDefaultJoinOption

The default join type of the rail.

## Syntax (C#)
```csharp
public enum RailTypeDefaultJoinOption
```